<template>
  <div class="wrapper">
    <div class="inner">
      <h3 class="head-text">Хто ми?</h3>
      <p class="text bg">Ми - <a href="https://www.facebook.com/profile.php?id=100010814506974">Олена</a> та <a href="https://www.facebook.com/oleg.yerokhin">Олег</a> Єрохіни, подружжя з Харкова</p>
      <span class="flexible bg">
        <p class="text">Ми були, як і тисячі інших щасливих пар. Ми кохали, працювали, їздили у відпустку, ходили в гості до друзів. Ми гуляли в парку Горького, що знаходиться зовсім поруч від нашого дому, їздили по покупки на Центральний Ринок та в ходили в кіно в новенький "Нікольський". Ми зустрічали світанки на всім відомому майданчику на Журавлівському узвозі і гуляли з собакою уздовж дитячої залізниці в Лісопарку. Як і для багатьох в нашому місті, після 24 лютого 2022 року для нас залишилося незмінним лише кохання, яке в ці жахливі часи пройшло перевірку найстрашнішим випробуванням - війною. І воно лише зміцнішало.</p>
        <img class="photo" src="../assets/both.jpg" alt="Olena">
      </span>
      
      <span class="flexible bg">
        <img class="photo" src="../assets/Oleg.jpg" alt="Oleg">
        <p class="text">Зібравши найнеобхідніше і об'єднавшись з нашою родиною, ми довгий час трималися в самому центрі Харкова. Але наявність маленьких сестер та літніх бабусі і дідуся  змусили нас прийняти рішення про виїзд з міста, коли вибухи почали лунати зовсім поряд. Отже, ми заправили наші машини, розмістили наших котів і собаку, та рушили в різні сторони, залишивши Харків. Віримо, що лише тимчасово.</p>
      </span>
      <span class="flexible bg">
        <p class="text">З пригодами діставшись батьківщини Олени - міста Володимир на Волині, ми мали час, аби перевести подих і вирішити, що робити далі і чим в даній ситуації ми можемо бути корисні. Згадуючи своє перебування під обстрілами вдома, ми зрозуміли, що далеко не всі мають можливість вистояти чергу до магазину, якщо поряд ще залишився такий. Також, ми зіткнулися в цей період з нестачею специфічних ліків. Так, дідусю були необхідні препарати від тиску та діабету, які в місті в той час знайти було майже нереально. Крім того, далеко не всі бажаючі могли безпечно дістатися до вокзалу, аби сісти в евакуаційний потяг, навіть якщо таким людям було до кого їхати. Тож відповідь прийшла сама собою. Ми вирішили займатися адресною доставкою їжі та ліків нужденним, а також допомагати безпечно дістатися Західної України тим, в кого є бажання, але немає можливості.</p>
        <img class="photo" src="../assets/Lena.jpg" alt="Oleg & Olena">
      </span>
      <p class="text bg">Наразі, ми вже маємо налагоджену схему з постачання людей, що потрапили в скруту, їжею та ліками, а також з перевезення на захід тих, хто готовий залишити свій дім, натомість отримавши спокій та безпеку, без необхідності сидіти у підвалі дні та тижні.</p>
      <p class="text bg">Ми готові допомогти кожному, хто звернеться і хто дійсно потребує допомоги. Просто зверніться до нас за контактами, що залишені у відповідному розділі нашого сайту.</p>
      <p class="text bg">Єднаймося і допомагаємо одне одному і нашим Героям на фронті! Все буде Україна!</p>
      <button class="contact-button" @click="$router.push({name: 'Contacts'})">Зв'язатися з нами</button>
    </div>
  </div>
</template>

<script>
export default {
  name: 'About'
}
</script>

<style scoped>
.wrapper {
  background: url(../assets/about-us.jpg) 0 0 no-repeat;
  background-size: cover;
  background-position-x: -660px;
}

.inner {
  padding: 45px;
}

.head-text {
  color: #fff;
  font-size: 40px;
  font-weight: 700;
  background: rgba(0, 0, 0, 0.647);
  margin: 30px;
  padding: 30px;
}

.text {
  color: #fff;
  line-height: 1.8;
  padding: 30px;
  margin: 30px;
  font-size: 18px;
}

.flexible {
  display: flex;
}

.bg {
  background: rgba(0, 0, 0, 0.647);
  margin: 30px;
}

.photo {
  width: 300px;
}

.contact-button {
  display: inline;
  margin-bottom: 15px;
  background: #00000069;
  border: 3px solid rgb(0, 141, 212);
  color: #fff;
  border-radius: 20px;
  padding: 5px 15px;
  width: 185px;
}

.contact-button:hover {
  background: #cbcbcb4d;
}
</style>