<template>
  <div class="wrapper">
    <div class="inner">
      <h3 class="head-text">Наша діяльність</h3>

      <p class="text list">
        <span><p class="text-center  text-uppercase">На даний момент ми працюємо в наступних напрямках: <br></p></span>
       
        - пересилання їжі для осіб, які з якоїсь причини нездатні забезпечити свої потреби в харчуванні; <br>
        - пересилання ліків для осіб; <br>
        - допомога в переселенні на територію Західної України з місць, які є або можуть стати небезпечними внаслідок збройної агресії <s>росії</s>; <br>
        - допомога Армії.
      </p>
      <p class="text">
        Містом закупок є Володимир Волинської області, а отже все, чим ми можемо допомогти, ми купуємо або отримуємо саме тут (вийнятком є лише волонтерство на користь армії - це значно складніший процес). Ми готові знайти та відправити до Вас будь-які товари, які ми можемо дістати без виїзду з міста. Це стосується їжі, ліків, дитячого харчування, памперсів (як для дітей, так і для дорослих людей, що не можуть самі себе обслужити). Окремі позиції лікарських засобів можуть бути попередньо замовлені з інших міст, оскільки ми неодноразово стикалися з ситуацією, коли мережі аптек відмовляються доставляти ліки на схід, навіть якщо в пункті призначення є робочі відділення Нової Пошти або Укрпошти, а мережа здійснює відправлення замовлень в інші міста.  
      </p>
      <p class="text list">
        <span><p class="text-center alert">Увага!</p></span>
        <span><p class="text-center text-uppercase">Ми не здійснюємо пересилання наступних категорій товарів:</p></span>
        - алкоголь; <br>
        - безалкогольні напої в скляній, залізній або пластиковій тарі; <br>
        - цигарки, сигари; <br>
        - побутова хімія; <br>
        - електроніка; <br>
        - канцелярські товари; <br>
        - одяг, взуття (виключення становлять одяг та взуття для потреб армії); <br>
        - легкозаймисті або отруйні речовини; <br>
        - нарковмісні лікарські препарати; <br>
        - наркотичні, психотропні речовини та їхні прекурсори; <br>
        - інші товари, обіг яких заборонений чи контролюється державою. 
      </p>
      <p class="text list">
        <span><p class="text-center alert">Увага!</p></span>
        Ми переконливо просимо не звертатися до нас тих осіб, які можуть забезпечити свої потреби самотужки за власний кошт! Пам'ятайте, кожен, хто отримує допомогу, якої він насправді не потребує, забирає шанс в тих, для кого отримання такої допомоги є в прямому сенсі питанням життя і смерті. Сподіваємося на вашу свідомість в цьому питанні!
      </p>
      <p class="text">
        Ви можете замовити необхідні Вам товари, зв'язавшись із нами через залишені у відповідному розділі нашого сайту.
      </p>
      <button class="contact-button" @click="$router.push({name: 'Contacts'})">Зв'язатися з нами</button>

    </div>
  </div>
</template>

<script>
export default {
  name: 'Activities',
}
</script>

<style scoped>
.wrapper {
  background: url(../assets/gerb.webp) 0 0 no-repeat;
  background-size: cover;
  background-attachment: fixed;
}

.inner {
  padding: 45px;
}

.head-text {
  color: #fff;
  font-size: 40px;
  font-weight: 700;
  background: rgba(0, 0, 0, 0.647);
  margin: 30px;
  padding: 30px;
}

.text {
  color: #fff;
  background: rgba(0, 0, 0, 0.647);
  font-size: 18px;
  padding: 30px;
  line-height: 1.8;
}

.alert {
  font-size: 30px;
  font-weight: 700;
  text-decoration: red underline;
}

.list {
  text-align: left;
}

.contact-button {
  display: inline;
  margin-bottom: 15px;
  background: #00000069;
  border: 3px solid rgb(0, 141, 212);
  color: #fff;
  border-radius: 20px;
  padding: 5px 15px;
  width: 185px;
}

.contact-button:hover {
  background: #cbcbcb4d;
}
</style>